Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་ལ་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་དུ་གསོལ།
en: They all requested the Thus-Gone One to turn the wheel of Dharma with these words: “May the Blessed One now turn the wheel of Dharma for the benefit and happiness of many beings, for the love of the world, for the well-being and happiness of great numbers of beings, both gods and humans.

source: བདེ་བར་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་དུ་གསོལ།
en: Well-Gone One, please make this offering of Dharma.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་མཆོད་སྦྱིན་མཛད་དུ་གསོལ། ཆོས་ཀྱི་ཆར་ཆེན་པོ་དབབ་ཏུ་གསོལ།
en: Lord, please shower the rain of Dharma!

source: ཆོས་ཀྱི་རྒྱལ་མཚན་ཆེན་པོ་བསྒྲེང་དུ་གསོལ།
en: Unfold the great victory banner of the Dharma!

source: ཆོས་ཀྱི་དུང་ཆེན་པོ་འབུད་དུ་གསོལ།
en: Blow the great conch of the Dharma!

source: ཆོས་ཀྱི་རྔ་ཆེན་པོ་བརྡུང་དུ་གསོལ། ཞེས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བསྐུལ་ཏོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Beat the great drum of the Dharma!” About this, it is said:

source: སྟོང་གསུམ་འདི་ནས་ཚངས་པ་ལྷ་དབང་སྐྱོང་བ་མང་པོ་དག །དོང་ནས་རྒྱལ་བའི་ཞབས་ལ་གཏུགས་ཏེ་ཚིག་ཏུ་སྨྲས་པ་ནི།
en: From throughout the trichiliocosm, Brahmā, Śakra, and many guardians Appeared, and Bowing their heads to the Victorious One, they said:

source: །ང་ནི་གཙོ་བོ་དམ་པ་སྐྱེ་དགུའི་སྡུག་བསྔལ་ཟད་བྱ་ཞེས། །ཐུབ་ཆེན་ཁྱོད་ཀྱིས་གསུང་བརྗོད་སྔོན་གྱི་ཐུགས་དམ་དགོངས་པར་མཛོད། །ཐུབ་ཁྱོད་ཤིང་དབང་དྲུང་དུ་བཞུགས་ནས་སྡེར་བཅས་བདུད་བཏུལ་ཏེ། །བྱང་ཆུབ་དམ་པ་ཞི་བ་སངས་རྒྱས་ཉོན་མོངས་སྡོང་པོ་བསྒྱེལ།
en: “Great Sage, please remember your earlier promise when previously you said, ‘I am the first and the best, I will end suffering for all beings.’ Sage, as you sat below the holy tree, You tamed Māra and his minions, And the peace and sacredness of your supreme awakening felled the tree of disturbing emotions.

source: །བསྐལ་པ་བརྒྱ་ནས་དགོངས་པའི་དགོངས་པ་མ་ལུས་རྫོགས་ལགས་ཀྱིས།
en: Now that all the intentions that you nurtured for a hundred eons have been fulfilled,.

source: །མགོན་མ་མཆིས་པའི་སྐྱེ་བོ་གཟིགས་ཏེ་འཁོར་ལོ་མཆོག་བསྐོར་གསོལ།
en: So Look upon beings bereft of a protector, and turn the supreme wheel.”

source: །བདེ་བར་གཤེགས་པའི་འོད་ཀྱིས་ཞིང་སྟོང་ཕྲག་བརྒྱ་སྣང་བར་བགྱིས། །སངས་རྒྱས་སྲས་པོ་བརྒྱ་ཕྲག་མང་པོ་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་མཆིས།
en: The light of the Well-Gone One illuminated hundreds of thousands of buddha realms, Bringing many hundreds of sons of the buddhas through miraculous power Wly.

source: །བདེ་བར་གཤེགས་ལ་མཆོད་པ་ཆེན་པོ་རྣམ་པ་མང་བགྱིས་ནས། །ཡང་དག་ཡོན་ཏན་དེ་བཞིན་གཤེགས་བསྟོད་ཐུགས་རྗེ་ཅན་ལ་བསྐུལ།
en: Tho offered the Well-Gone One vast and manifold offerings, Praised the Thus-Gone One’s true qualities, and invoked the compassionate one thus:

source: །ཐུགས་རྗེ་སྤྲིན་དང་ཤེས་རབ་གློག་དང་ལྷག་མཐོང་རླུང་དང་འདྲ།
en: “Like a compassionate cloud, a lightning bolt of wisdom, and a wind of insight,

source: །བསྐལ་པ་སྟོང་དུ་འགྲོ་བ་ཐམས་ཅད་འགྲོན་གཉེར་འབྲུག་བསྒྲགས་ཏེ།
en: For a thousand eons you have nourished beings with your thunderous voice.

source: །ཡན་ལག་བརྒྱད་ལམ་ཆར་གྱི་རྒྱུན་གྱིས་སྐོམ་པ་ཞི་བར་མཛོད།
en: Please pacify their thirst with the downpour from the rain cloud of the eightfold path;

source: །དབང་པོ་སྟོབས་དང་བསམ་གཏན་རྣམ་ཐར་ལོ་ཏོག་ནགས་འཕེལ་མཛོད།
en: May your powers, faculties, and concentration make the harvest of liberation bountiful.

source: །བསྐལ་པ་སྟོང་མང་སྟོང་པ་ལེགས་བསླབས་དེ་བཞིན་ཉིད་ལ་བཞུགས།
en: “For many thousands of eons, you have trained well and rested in the suchness of emptiness;

source: །ཆོས་ལས་བྱུང་བའི་སྨན་བསྒྲུབས་སེམས་ཅན་རྣམས་ཀྱི་སྤྱོད་པ་མཁྱེན།
en: You dispense the medicine of the Dharma and know the lives of sentient beings.

source: །ཉོན་མོངས་ཚོགས་ཀྱི་ནད་བརྒྱས་གཙེས་པའི་སྐྱེ་བོ་འདི་དག་ལ།
en: For human beings, tormented by the hundred diseases of disturbing emotions,

source: །རྒྱལ་བ་སྨན་པ་འཁོར་ལོ་དམ་པ་བསྐོར་ཏེ་ཐར་མཛད་གསོལ།
en: Victorious Physician, please turn the supreme wheel of Dharma and liberate beings.

source: །ཁྱོད་ཀྱིས་རིང་ནས་ཕ་རོལ་ཕྱིན་པ་དྲུག་གི་མཛོད་འཕེལ་མཛད།
en: “For so long you increased the six perfections;

source: །མཚུངས་མེད་མི་གཡོ་གྱ་ནོམ་ཆོས་ཀྱི་ནོར་ནི་ལེགས་པར་བསགས།
en: You performed and amassed an incomparable and immutable wealth of Dharma.

source: །སྐྱེ་དགུ་མགོན་མེད་དབུལ་པོ་འདྲེན་མེད་འདི་དག་ཀུན་གཟིགས་ནས།
en: As you behold all these beings without protection, wealth, or guidance,

source: །ནོར་བདུན་བགོ་བཤའ་མཛོད་ཅིག་འདྲེན་པ་འཁོར་ལོ་བསྐོར་བར་གསོལ།
en: Noble Guide, please share the seven types of wealth and turn the wheel.

source: །རྒྱལ་བ་བྱང་ཆུབ་བཙལ་ཕྱིར་ནོར་འབྲུ་དབྱིག་དང་གསེར་རྣམས་དང་། །གོས་བཟང་མེ་ཏོག་བདུག་པ་བྱུག་པ་ཕྱེ་མ་དམ་པ་དང་། །ཕོ་བྲང་མཆོག་དང་བཙུན་མོའི་འཁོར་དང་རྒྱལ་སྲིད་ཕངས་པའི་སྲས།
en: “Seeking the awakening of the victorious ones, you joyfully relinquished your fortune, Riches, treasures, gold, fine robes, beautiful flowers, ointments, scented powders, Finest dwellings, your retinue of consorts, the kingdom, even your beloved son.

source: །དགྱེས་བཞིན་བཏང་བས་དེ་སངས་རྒྱས་ཀྱིས་འཁོར་ལོ་མཆོག་བསྐོར་གསོལ།
en: Perfect Buddha, please turn the supreme wheel.

source: །དེ་བཞིན་ཚུལ་ཁྲིམས་མ་ཉམས་མ་འདྲེས་བསྐལ་པ་བརྒྱར་ཡང་བསྲུངས།
en: “For a hundred eons you have likewise kept your discipline intact and pure,

source: །རྟག་ཏུ་བཟོད་པ་ལེགས་བསྒོམས་ཁྱོད་ནི་བརྩོན་འགྲུས་མ་ཞུམ་གྱུར།
en: Always training in patience and with your diligence never waning.

source: །ཐུབ་པ་བསམ་གཏན་མཆོག་དང་མངོན་ཤེས་ཤེས་རབ་ལྷག་མཐོང་ལྡན།
en: Sage, your concentration is supreme and your insight is a clairvoyant wisdom;

source: །དགོངས་པ་ཡོངས་རྫོགས་རིམས་ནད་མ་མཆིས་འཁོར་ལོ་མཆོག་བསྐོར་གསོལ།
en: With your intent fulfilled, please remove the fever and turn the supreme wheel.”

source: །དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཞེས་བྱ་བས་དེའི་ཚེ་ཆོས་ཀྱི་འཁོར་ལོ་ལྷའི་འཛམ་བུ་ཆུ་བོའི་གསེར་ལས་བྱས་པ།
en: Monks, at that point a bodhisattva, a great being, known as the One Who Turns the Wheel When the Intent Is Formed, offered a Dharma wheel to the Thus-Gone One.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་མཛེས་པར་བྱས་པ་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ། བཀོད་པ་རྩིབས་སྟོང་དང་ལྡན་པ།
en: It was an exquisite wheel adorned with all kinds of jewels, gems, and various other embellishments.

source: འོད་ཟེར་སྟོང་ཕྲག་དང་ལྡན་པ། ལྟེ་བ་དང་བཅས་པ། མུ་ཁྱུད་དང་བཅས་པ།
en: It had a hub, a rim, and a thousand spokes.

source: མེ་ཏོག་གི་ལྡ་ལྡི་དང་བཅས་པ། །གསེར་གྱི་དྲ་བ་དང་བཅས་པ། དྲིལ་བུ་གཡེར་ཀ་དང་བཅས་པ། སྤོས་ཀྱི་ལག་རིས་དང་བཅས་པ།
en: It was adorned with flower garlands, lattices of gold, tassels with bells, and the motifs of an elephant in rut, a filled vase, and a swastika.

source: བུམ་པ་གང་བ་དང་བཅས་པ། གཡུང་དྲུང་འཁྱིལ་བ་དང་བཅས་པ། བཀྲ་ཤིས་ཀྱི་བརྒྱན་པ་དང་བཅས་པ། ལྷའི་གོས་ཚོན་སྣ་ཚོགས་སུ་བཅོས་པས་མཛེས་པར་བྱས་པ།
en: The wheel was adorned with various marks of auspiciousness, beautifully wrapped in divine fabrics and dyed in different colors.

source: ལྷའི་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པས་བྱུགས་པ།
en: It was strewn with flowers of the heavens, adorned with fragrant garlands, and rubbed with perfumed ointments.

source: རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ།
en: In this way it was a wheel as beautiful as can be.

source: སྔོན་གྱི་སྨོན་ལམ་གྱིས་བསྒྲུབས་པ། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པས་རྣམ་པར་སྦྱངས་པ།
en: It came about through the power of previous aspirations made as the Bodhisattva had trained.

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་འོས་སུ་གྱུར་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དགོངས་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་མ་འཁྲུགས་པ།
en: It was truly a suitable offering to the Thus-Gone One. Since all the previous thus-gone ones in succession had accepted this wheel, it possessed the unbroken blessings of all the buddhas.

source: སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་གཞེས་ཤིང་སྔོན་ཡང་བསྐོར་བ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ལོ།
en: In fact this wheel had previously been turned by all former thus-gone ones, worthy ones, perfect buddhas, and therefore it was now offered to the Thus-Gone One to turn.

source: །ཕུལ་ནས་ཀྱང་ཐལ་མོ་སྦྱར་ཏེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: Once he had made his offering to the Thus-Gone One, the bodhisattva joined his palms and praised the Thus-Gone One with these verses: “When Dīpaṃkara made the prediction for the Pure One,

source: །མི་ཡི་སེང་གེ་སེང་གེ་ཁྱོད་ནི་སངས་རྒྱས་འགྱུར་རོ་ཞེས། །གང་ཚེ་མར་མེ་མཛད་ཀྱིས་སེམས་ཅན་དག་པ་ལུང་བསྟན་པ།
en: He said, ‘You will become a buddha, a lion among the lions of men.’

source: །དེ་ཚེ་བདག་གིས་སྨོན་ལམ་རྣམ་པ་འདི་འདྲ་འདི་བཏབ་སྟེ།
en: At that time I made the following aspiration:

source: །རྫོགས་པའི་བྱང་ཆུབ་བརྙེས་ནས་བདག་གིས་ཆོས་བཤད་བསྐུལ་ཞེས་བགྱིས།
en: ‘When I become perfectly enlightened, I will seek the Dharma.’

source: །ཕྱོགས་བཅུ་དག་ནས་སེམས་ཅན་དམ་པ་གང་དག་འདིར་ལྷགས་པ།
en: “Today the best of beings have come here from the ten directions,

source: །དེ་དག་ཐམས་ཅད་འཇུག་པས་བགྲང་བར་ནུས་པ་མ་ལགས་ཏེ།
en: So many in number that they cannot be counted.

source: །བཏུད་ཅིང་ཐལ་མོ་སྦྱར་ནས་ཞབས་གཉིས་ལ་ནི་གཏུགས་ནས་སུ།
en: With joined palms they bow at the Thus-Gone One’s feet

source: །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཕྱིར་ཤཱཀྱའི་རིགས་ལ་དགྱེས་པ་བསྐུལ།
en: And request the joy of the Śākya clan to turn the wheel of Dharma.

source: །བྱང་ཆུབ་སྙིང་པོར་ལྷ་རྣམས་ཀྱིས་ནི་བཀོད་པ་གང་བགྱིས་དང་། །རྒྱལ་བའི་སྲས་པོ་ཀུན་གྱིས་བཀོད་པ་གང་དག་བགྱིས་པ་རྣམས།
en: “The offerings of the gods at the seat of awakening, And the arrays of the sons of the victorious ones—

source: །འབྱོར་པ་དེ་ཀུན་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཕྱིར་འདིར་བཤམས་ཏེ།
en: They all stand together, set forth for the wheel of Dharma.

source: །བསྐལ་པ་ཡོངས་སུ་རྫོགས་པར་བརྗོད་ཀྱང་བས་པར་འགྱུར་མ་ལགས།
en: The complete array could never be fully described.

source: །སྟོང་གསུམ་འཇིག་རྟེན་དག་གི་ནམ་མཁའ་ལྷ་ཡི་ཚོགས་ཀྱིས་བལྟམས།
en: “The heavens above this trichiliocosm are filled with gods,

source: །དོག་སའི་སྟེང་ཡང་ལྷ་མིན་མིའམ་ཅི་དང་མི་ཡིས་བལྟམས།
en: And on earth demigods, kinnaras, and humans roam.

source: །ཡུད་ཙམ་དེ་ལ་ལུད་པའི་སྒྲ་ཡང་གྲགས་པར་མ་གྱུར་ཏེ།
en: Yet no sound can be heard at this very moment

source: །ཐམས་ཅད་རབ་ཏུ་དང་བའི་ཡིད་ཀྱིས་རྒྱལ་ལ་མངོན་དུ་བལྟ།
en: As everyone looks with a peaceful mind to the Victorious One.”

source: །དགེ་སློང་དག་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ནམ་གྱི་ཆ་སྟོད་ཀྱི་ཐུན་ལ་ནི་ཅང་མི་གསུང་བས་ཟད་པར་མཛད་དོ།
en: Monks, the Thus-Gone One now spent the first part of the night in silence.

source: །ནམ་གྱི་གུང་ཐུན་ལ་ནི་ཡང་དག་པར་ཆགས་པར་འགྱུར་བའི་གཏམ་གསུང་ངོ་།
en: During the middle part of the night, he gave an eloquent talk.

source: །ནམ་གྱི་ཆ་སྨད་ཀྱི་ཐུན་ལ་ནི་ལྔ་སྡེ་བཟང་པོ་རྣམས་ལ་བོས་ཏེ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Finally, during the last part of the night, he summoned the five excellent companions and said:

source: །དགེ་སློང་དག་མཐའ་གཉིས་པོ་འདི་དག་ནི་རབ་ཏུ་བྱུང་བའི་འཇུག་པར་བྱ་བ་མ་ཡིན་པ་སྟེ། གང་འདོད་པ་རྣམས་ལ་བསོད་ཉམས་སུ་སྦྱོར་བ། དམན་པ། གྲོང་བའི་ཆ།
en: “Monks, there are two extremes that you should avoid when you have taken ordination.

source: སོ་སོའི་སྐྱེ་བོ་པ། འཕགས་པ་ལ་མི་མཁོ་བ། གནོད་པ་དང་ལྡན་པ། ཕྱི་མ་ལ་ཚངས་པར་སྤྱོད་པར་མི་འགྱུར་བ།
en: First do not follow self-indulgence, which is shallow, worldly, ordinary, unworthy of a noble one, and attended by undesired consequences.

source: ཡིད་འབྱུང་བར་མི་འགྱུར་བ།
en: In the long run it will prevent you from practicing your religion.

source: འདོད་ཆགས་དང་བྲལ་བར་མི་འགྱུར་བ།
en: You will become distracted and unable to develop nonattachment.

source: །འགོག་པར་མི་འགྱུར་བ། མངོན་པར་ཤེས་པར་མི་འགྱུར་བ། རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མི་འགྱུར་བ།
en: You will not enter into the state of cessation nor develop higher knowledge, or attain the perfect awakening of nirvāṇa.

source: མྱ་ངན་ལས་འདའ་བར་མི་འགྱུར་བ་དང་། གང་ཡང་དབུ་མའི་ལམ་མ་ཡིན་པ།
en: On the other hand, straying from the middle way, you will not pass beyond suffering.

source: ལུས་ངལ་བར་སྦྱོར་བ། སྡུག་བསྔལ་བ། གནོད་པ་དང་ལྡན་པ། ཚེ་འདི་ལ་ཡང་སྡུག་བསྔལ་ལ། ཕྱི་མ་ལ་ཡང་སྡུག་བསྔལ་རྣམ་པར་སྨིན་པ་སྟེ།
en: If you mistreat your body so that it suffers and is harmed, you will face difficulties as can be observed right now, and in the future even further misery will fall on you.

source: དགེ་སློང་དག་མཐའ་གཉིས་པོ་འདི་དག་སྤངས་ནས་དབུ་མའི་ལམ་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་ཏེ།
en: “Monks, the Thus-Gone One teaches the Dharma by showing the middle way that does not fall into either of the two extremes.

source: འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏོ།
en: The Dharma that he teaches is one of correct view, intention, speech, action, livelihood, effort, mindfulness, and concentration.

source: །དགེ་སློང་དག་བཞི་པོ་འདི་དག་ནི་འཕགས་པའི་བདེན་པ་དག་སྟེ།
en: “Monks, there are also four truths of the noble ones.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: སྡུག་བསྔལ་བ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་མོ།
en: Suffering, the origin of suffering, the cessation of suffering, and the path that leads to the cessation of suffering.

source: །དེ་ལ་སྡུག་བསྔལ་གང་ཞེ་ན།
en: “What is suffering?

source: སྐྱེ་བའི་སྡུག་བསྔལ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མི་སྡུག་པ་དང་ཕྲད་པ་དང་། སྡུག་པ་དང་བྲལ་བའི་སྡུག་བསྔལ་དང་། གང་ཡང་འདོད་པ་བཙལ་ཏེ་མ་རྙེད་པ་དེ་ཡང་སྡུག་བསྔལ་ལོ།
en: It is the pain that accompanies birth, growing old, falling sick, and dying. It also includes the suffering of meeting the unpleasant and parting from the pleasant. Not finding what is being sought is also suffering.

source: །མདོར་ན་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་དག་ནི་སྡུག་བསྔལ་ཏེ།
en: In short the five perpetuating aggregates are suffering.

source: འདི་ནི་སྡུག་བསྔལ་ཞེས་བྱའོ།
en: This is what we call suffering.

source: །དེ་ལ་སྡུག་བསྔལ་ཀུན་འབྱུང་བ་གང་ཞེ་ན།
en: “What is the origin of suffering?

source: གང་འདི་ཡང་འབྱུང་བའི་སྲེད་པ་དང་། དགའ་བའི་འདོད་ཆགས་དང་ལྡན་པ་དང་། དེ་དང་དེར་མངོན་པར་དགའ་བ་སྟེ།
en: It is the craving that perpetuates existence, which is attended upon by the passion for enjoyment, and which finds pleasures here and there.

source: འདི་ནི་སྡུག་བསྔལ་ཀུན་འབྱུང་བ་ཞེས་བྱའོ།
en: That is the origin of suffering.

source: །དེ་ལ་སྡུག་བསྔལ་འགོག་པ་གང་ཞེ་ན།
en: “What is the cessation of suffering?

source: གང་ཡང་འབྱུང་བ་དེའི་སྲེད་པ་དང་། དགའ་བའི་འདོད་ཆགས་དང་ལྡན་པ་དང་། དེ་དང་དེར་མངོན་པར་དགའ་བ་དང་། སྐྱེད་པ་དང་། སྒྲུབ་པ་འདི་ཉིད་ལ་འདོད་ཆགས་མ་ལུས་པ་དང་བྲལ་བ་དང་། འགོག་པ་འདི་ནི་སྡུག་བསྔལ་འགོག་པའོ།
en: It is the complete and dispassionate cessation of craving that perpetuates existence, which is attended upon by the passion for enjoyment, and which finds pleasures here and there.

source: །དེ་ལ་སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་གང་ཞེ་ན།
en: This is the cessation of suffering. “What is the path that leads to the cessation of suffering?

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་འདི་ཉིད་དེ། འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་ནས། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་གྱི་བར་དུ་སྟེ།
en: It is exclusively the eightfold path of the noble ones. This is the path that starts with correct view and ends with correct concentration.

source: འདི་ནི་སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ།
en: It is called the path that leads to the cessation of suffering—a noble truth.

source: །དགེ་སློང་དག་བཞི་པོ་འདི་དག་ནི་འཕགས་པའི་བདེན་པ་དག་ཅེས་བྱའོ།
en: “Monks, these four truths are the truths of the noble ones.

source: །དགེ་སློང་དག་ངས་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་འདི་ནི་སྡུག་བསྔལ་ལོ་ཞེས་ཚུལ་བཞིན་ཡིད་ལ་བྱས་ཤིང་མང་དུ་བྱས་པས་ཡེ་ཤེས་སྐྱེས། མིག་སྐྱེས། རིག་པ་སྐྱེས། མང་པོ་ཤེས་པ་སྐྱེས། ཡིད་གཞུངས་པ་སྐྱེས། ཤེས་རབ་སྐྱེས་སོ། །སྣང་བ་བྱུང་ངོ་།
en: “Monks, this teaching I had not heard previously. I understood it by intensely and introspectively focusing my mind on suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest.

source: །དགེ་སློང་དག་ངས་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་འདི་ནི་སྡུག་བསྔལ་ཀུན་འབྱུང་བའོ་ཞེས་ཚུལ་བཞིན་ཡིད་ལ་བྱས་ཤིང་མང་དུ་བྱས་པས་ཡེ་ཤེས་སྐྱེས། མིག་སྐྱེས། རིག་པ་སྐྱེས། མང་པོ་ཤེས་པ་སྐྱེས། ཡིད་གཞུངས་པ་སྐྱེས། ཤེས་རབ་སྐྱེས་སོ། །སྣང་བ་བྱུང་ངོ་།
en: “Monks, this teaching I had not heard previously. I understood it by focusing intently on the origin of suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest.

source: །དགེ་སློང་དག་ངས་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་འདི་ནི་སྡུག་བསྔལ་འགོག་པའོ་ཞེས་ཚུལ་བཞིན་ཡིད་ལ་བྱས་ཤིང་མང་དུ་བྱས་པས་ཡེ་ཤེས་སྐྱེས། མིག་སྐྱེས། རིག་པ་སྐྱེས། མང་པོ་ཤེས་པ་སྐྱེས། ཡིད་གཞུངས་པ་སྐྱེས། ཤེས་རབ་སྐྱེས་སོ། །སྣང་བ་བྱུང་ངོ་།
en: “Monks, this teaching I had not heard previously. I understood it by focusing intently on the cessation of suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest.

source: །དགེ་སློང་དག་ངས་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་འདི་ནི་སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་མོ་ཞེས་བྱ་བ་ནས་སྣང་བ་བྱུང་ངོ་ཞེས་བྱ་བའི་བར་དུ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ།
en: “Monks, this teaching I had not heard previously. I understood it by focusing intently on the path that leads to the cessation of suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest.

source: །དགེ་སློང་དག་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པར་བྱའོ་ཞེས་བྱ་བ་ནས་སྣང་བ་བྱུང་ངོ་། །ཞེས་བྱ་བའི་བར་དུ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ།
en: “Monks, within this teaching that I had not heard previously, suffering must be known. This I understood by focusing intently on suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest.

source: །དགེ་སློང་དག་ངས་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་སྡུག་བསྔལ་ཀུན་འབྱུང་བ་འདི་སྤང་བར་བྱའོ་ཞེས་བྱ་བ་ནས་སྣང་བའི་བར་དུ་ཐམས་ཅད་སྔ་མ་བཞིན་ནོ། །
en: “Monks, within this teaching that I had not heard previously, the origin of suffering must be abandoned. This I understood by focusing intently on the origin of suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest. “Monks, within this teaching that I had not heard previously, the cessation of suffering must be actualized. This I understood by focusing intently on the cessation of suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest.

source: དགེ་སློང་དག་སྡུག་བསྔལ་འགོག་པ་འདི་མངོན་དུ་བྱའོ་ཞེས་བྱ་བ་ནས་སྣང་བའི་བར་དུ་སྔ་མ་བཞིན་ནོ།
en: “Monks, within this teaching that I had not heard previously, the path that leads to the cessation of suffering must be practiced. This I understood by focusing intently on the path that leads to the cessation of suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest.

source: །དགེ་སློང་དག་སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་འདི་བསྒོམ་པར་བྱའོ་ཞེས་བྱ་བ་ནས་སྣང་བ་ཞེས་བྱ་བའི་བར་དུ་སྔ་མ་བཞིན་ནོ།
en: “Monks, within this teaching that I had not heard previously, I have fully understood suffering. This I did by focusing intently on suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest.

source: །དགེ་སློང་དག་ངས་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་སྡུག་བསྔལ་འདི་ཡོངས་སུ་ཤེས་སོ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་དུ་སྦྱར་རོ།
en: “Monks, within this teaching that I had not heard previously, I have abandoned the origin of suffering. This I did by focusing intently on the origin of suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest.

source: །དགེ་སློང་དག་ངས་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་སྡུག་བསྔལ་ཀུན་འབྱུང་བ་འདི་སྤངས་སོ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་དུ་སྦྱར་རོ།
en: “Monks, within this teaching that I had not heard previously, I have actualized the cessation of suffering. This I did by focusing intently on the cessation of suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest.

source: །དགེ་སློང་དག་ངས་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་སྡུག་བསྔལ་འགོག་པ་འདི་མངོན་དུ་བྱས་སོ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་དུ་སྦྱར་རོ།
en: “Monks, within this teaching that I had not heard previously, I have practiced the path that leads to the cessation of suffering. This I did by focusing intently on the path that leads to the cessation of suffering. In this way my wisdom, vision, understanding, intellect, intelligence, knowledge, and insight became manifest.

source: །དགེ་སློང་དག་ངས་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་འདི་བསྒོམས་སོ་ཞེས་ཚུལ་བཞིན་ཡིད་ལ་བྱས་ཤིང་མང་དུ་བྱས་པས། ཡེ་ཤེས་སྐྱེས། མིག་སྐྱེས། རིག་པ་སྐྱེས། མང་པོ་ཤེས་པ་སྐྱེས། ཡིད་གཞུངས་པ་སྐྱེས། ཤེས་རབ་སྐྱེས་སོ། །སྣང་བ་བྱུང་ངོ་།
en: “Monks, in this way I genuinely contemplated each of the four truths of the noble ones while I recited them three times. Still I did not develop the wisdom that sees their twelve aspects.

source: །དགེ་སློང་དག་དེ་ལྟར་ངས་འཕགས་པའི་བདེན་པ་བཞི་པོ་འདི་དག་ལ་འདི་ལྟར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ན་ཇི་སྲིད་དུ་ལན་གསུམ་དུ་བཟླས་ཏེ། རྣམ་པ་བཅུ་གཉིས་སུ་བསྐོར་བའི་ཡེ་ཤེས་མཐོང་བ་མ་སྐྱེས་པ་དེ་སྲིད་དུ་དགེ་སློང་དག་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་ཁས་མ་འཆེས་ཏེ་ང་ལ་ཡེ་ཤེས་མཐོང་བ་མ་སྐྱེས་སོ།
en: Monks, therefore I did not make any claims of having awakened to unsurpassable, perfect and complete buddhahood, and I still lacked the insight of wisdom.

source: །དགེ་སློང་དག་གང་ཚུན་ཆད་ངས་འཕགས་པའི་བདེན་པ་བཞི་པོ་འདི་དག་ལ་དེ་ལྟར་ལན་གསུམ་དུ་བཟླས་ཏེ། རྣམ་པ་བཅུ་གཉིས་སུ་བསྐོར་བའི་ཡེ་ཤེས་མཐོང་བ་སྐྱེས་ནས་ངས་སེམས་རྣམ་པར་གྲོལ་བ་དང་། ཤེས་རབ་རྣམ་པར་གྲོལ་བ་མི་འཁྲུགས་པ་མངོན་དུ་བྱས་པ་དེ་ཚུན་ཆད་དགེ་སློང་དག་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་ཁས་འཆེས་ཏེ།
en: “However, monks, once I had recited the four truths of the noble ones three times, I developed the wisdom that sees their twelve aspects. At that point my mind was free and my insight was now free and pure. Monks, at that point I declared that I had awakened to unsurpassable, perfect and complete buddhahood.

source: ངའི་ཡེ་ཤེས་མཐོང་བ་ཡང་སྐྱེས་སོ། །ངའི་སྐྱེ་བ་ཟད་དོ། །ཚངས་པར་སྤྱད་པ་བསྙེན་ཏོ། །བྱ་བ་བྱས་སོ། །འདི་ལ་སྲིད་པ་གཞན་མི་ཤེས་སོ།
en: My wisdom vision had been developed, my births had been exhausted, I had carried out my religious practice, I had done what needed to be done, and I will not have another life.”

source: དེ་ནི་ཚངས་དབྱངས་མིའམ་ཅི་ཡི་སྐད་ཀྱིས་གསུང་།
en: With the melody of Brahmā and the voice of a kinnara,

source: །ཡན་ལག་ཁྲག་ཁྲིག་སྟོང་འཕགས་བསྐལ་པ་བྱེ་མང་དུ།
en: Emanating trillions of light rays,

source: །རྟག་ཏུ་བདེན་པ་ཤིན་ཏུ་བསྒོམས་པས་རང་བྱུང་བ།
en: He, who had cherished the truth for many millions of eons,

source: །ཤཱཀྱ་ཐུབ་པས་ཀཽཎྜི་ནྱ་ལ་བཀའ་སྩལ་པ།
en: The Self-Arisen Śākyamuni, spoke these words to Kauṇḍinya:

source: །མིག་དང་རྣ་བ་སྣ་ནི་མི་རྟག་མི་བརྟན་ཏེ།
en: “The eyes, ears, and nose are impermanent and baseless;

source: །ལྕེ་དང་ལུས་དང་ཡིད་ཀྱང་སྡུག་བསྔལ་བདག་མེད་སྟོང་།
en: Likewise the tongue, body, and mind are also suffering, without self, and empty.

source: །བེམས་པོ་རང་བཞིན་རྩྭ་དང་རྩིག་པ་ལྟར་མི་གཡོ།
en: They are lifeless matter, inert like hay or a wall;

source: །འདི་ལ་བདག་མེད་མིང་དང་སྲོག་ཀྱང་ཡོད་མ་ཡིན།
en: There is no self here, neither a person nor life force.

source: །ཆོས་འདི་ཐམས་ཅད་རྒྱུ་ལ་བརྟེན་ནས་བྱུང་བ་སྟེ།
en: “All phenomena are causally produced;

source: །མཐའ་དང་མཐའ་མེད་ལྟ་དང་བྲལ་ཞིང་ནམ་མཁའ་འདྲ།
en: Beyond limits and without consciousness, they are like space.

source: །བྱེད་པ་པོ་མེད་དེ་བཞིན་ཚོར་བ་པོ་ཡང་མེད།
en: There is no agent and likewise no one who feels,

source: །དགེ་དང་མི་དགེ་བྱས་པའི་ལས་ནི་ཆུད་མི་ཟ།
en: And no action that can be observed as performed, be it good or bad.

source: །ཕུང་པོ་རྣམས་ལ་བརྟེན་ནས་འདི་ལྟར་སྡུག་བསྔལ་འབྱུང་།
en: “Suffering arises based on the aggregates;

source: །སྲེད་པ་ཆུ་ཡིས་རྣམ་པར་འཕེལ་ནས་འབྱུང་བར་འགྱུར།
en: The water of craving makes it grow.

source: །ལམ་གྱིས་ཆོས་རྣམས་མཉམ་པ་ཉིད་དུ་རྣམ་མཐོང་ནས།
en: On the path the aggregates are perceived to be the equality of phenomena;

source: །ཤིན་ཏུ་ཟད་ཅིང་བྱང་བའི་ཆོས་ཉིད་ཀྱིས་ནི་འགགས།
en: Infinitely diminished in harmony with the law of decay, they cease.
